//Параметры для подключения к серверу обновления 1С
Перем мБаза_Каталог, мБаза_Сервер, мБаза_Имя, мБаза_ИмяПользователя, мБаза_ПарольПользователя;
Перем мГИТ_Каталог;
Перем мИтсЛогин, мИтсПароль;
Перем мКаталогВременныхФайлов;
Перем мКаталогШаблоновОбновленийПлатформы;
Перем мКонфигурация_Версия;
Перем мПлатформа_Версия, мПлатформа_Путь;
Перем мПоставка_Акроним, мПоставка_Редакция;
Перем мПриУспехеОбновлятьСледующим;
Перем мСписокОбновлений_Архив, мСписокОбновлений_Файл;
Перем мТаймаутСоединения;

Процедура УстановитьНастройки()

    // http://downloads.1c.ru/ipp/ITSREPV/V8Update/Configs/SmallBusiness/30/83/UpdInfo.txt

    мПриУспехеОбновлятьСледующим = Истина;
    
    мПоставка_Акроним = "SmallBusiness";
    мПоставка_Редакция = "16";
    мПлатформа_Версия = "83";
    мПлатформа_Путь = "C:\Program Files\1cv8\8.3.23.1782\bin";

    // Заполнить одно из двух
        мБаза_Каталог = "C:\Users\paza\Documents\УНФ рус типовая";
    // ИЛИ
        мБаза_Сервер = ""; 
        мБаза_Имя = "";

    мБаза_ИмяПользователя = "";
    мБаза_ПарольПользователя = "";
    
    мИтсЛогин = "Абыр";
    мИтсПароль = "Абырвалг";
    мТаймаутСоединения = 60;

    мГИТ_Каталог = "C:\Users\paza\Documents\Git\unf_ru";

КонецПроцедуры

Процедура Основная()

    Сообщить("=========");
    Сообщить("Поехали!");

    УстановитьНастройки();

    мКаталогШаблоновОбновленийПлатформы = "C:\Users\paza\AppData\Roaming\1C\1cv8\tmplts\1c" ;
    мКаталогВременныхФайлов = 
        СтрШаблон(
            "%1\%2\!tmp",
            мКаталогШаблоновОбновленийПлатформы,
            мПоставка_Акроним // %2
        );

    мСписокОбновлений_Файл = мКаталогВременныхФайлов + "\v8cscdsc.xml";
    мСписокОбновлений_Архив = мКаталогВременныхФайлов + "\v8upd11.zip";
    
    СоздатьКаталог(мКаталогВременныхФайлов);
    УдалитьФайлы(мСписокОбновлений_Файл);
    УдалитьФайлы(мСписокОбновлений_Архив);
    
    // Качаем v8cscdsc.xml в виде v8upd11.zip
    // Создание HTTP-соединения с сервером обновлений
    соединениеОбновлений = Новый HTTPСоединение("downloads.1c.ru", , мИтсЛогин, мИтсПароль, , мТаймаутСоединения);
    адресРеусрса =
        СтрШаблон(
            "/ipp/ITSREPV/V8Update/Configs/%1/%2/%3/v8upd11.zip",
            мПоставка_Акроним, // %1
            мПоставка_Редакция, // %2
            мПлатформа_Версия // %3
        );
    запросКСерверуОбновлений = Новый HTTPЗапрос(адресРеусрса);
    соединениеОбновлений.Получить(запросКСерверуОбновлений, мСписокОбновлений_Архив);
    
    // Распаковываем v8cscdsc.xml
    чтениеАрхива = Новый ЧтениеZipФайла(мСписокОбновлений_Архив);
    чтениеАрхива.ИзвлечьВсе(мКаталогВременныхФайлов);
    чтениеАрхива.Закрыть();
    УдалитьФайлы(мСписокОбновлений_Архив);
    
    УстановитьРелизИПлатформу();
    
    Если мКонфигурация_Версия = Неопределено Тогда
        ВызватьИсключение "Не определена версия конфигурации";
        
    КонецЕсли;
    
    // Проверка версии информационной базы
    версияДляОбновления = ПолучитьВерсиюДляОбновления(мСписокОбновлений_Файл, мКонфигурация_Версия);
    Сообщить("Версия для обновления " + версияДляОбновления);
    
    Если версияДляОбновления = Неопределено Тогда
        стрСообщение = 
            СтрШаблон(
                "Текущая версия %1, обновление не требуется",
                мКонфигурация_Версия // %1
            );
        Сообщить(стрСообщение);
        Возврат;
        
    Иначе
        стрСообщение =
            СтрШаблон(
                "Текущая версия %1, выполняется обновление до %2",
                мКонфигурация_Версия, // %1
                версияДляОбновления // %2
            );
        Сообщить(стрСообщение);
        
    КонецЕсли;
    
    //в каталоге шаблонов через подчеркивание храняться
    версияДляОбновления = СтрЗаменить(версияДляОбновления, ".", "_");
    
    путьКШаблонуВерсииДляОбновления =
        СтрШаблон(
            "%1\%2\%3",
            мКаталогШаблоновОбновленийПлатформы, // %1
            мПоставка_Акроним, // %2
            версияДляОбновления // %3
        );

    путьКФайлуОбновления = СтрШаблон("%1\1cv8.cfu", путьКШаблонуВерсииДляОбновления);

    Если ФайлСуществует(путьКШаблонуВерсииДляОбновления) Тогда
        Сообщить("Каталог шаблона обновлений существует");

    Иначе
        Сообщить("Каталог шаблона обновлений не существует");

    КонецЕсли;

    Если ФайлСуществует(путьКФайлуОбновления) Тогда
        Сообщить("Путь к файлу обновления существует");

    Иначе
        Сообщить("Путь к файлу обновления не сущетсвует");

    КонецЕсли;

    // качаем новую версию, если уже не скачено
    Если НЕ ФайлСуществует(путьКШаблонуВерсииДляОбновления) Или Не ФайлСуществует(путьКФайлуОбновления) Тогда
        Сообщить("Качаю обновление с сайта");
        // Создание HTTP-соединения с сервером обновлений
        Заголовки = Новый Соответствие();
        Заголовки.Вставить("User-Agent", "1C+Enterprise/8.3"); //без заголовка сайт не даст скачать.
        соединениеОбновлений = Новый HTTPСоединение("downloads.v8.1c.ru", , мИтсЛогин, мИтсПароль, , мТаймаутСоединения);
        адресРесурса = "/tmplts/1c/" + мПоставка_Акроним + "/" + версияДляОбновления + "/1cv8.zip";
        Сообщить(адресРесурса);
        запросКСерверуОбновлений = Новый HTTPЗапрос(адресРесурса, Заголовки);

        путьАрхиваШаблона = мКаталогВременныхФайлов + "\1cv8.zip";
        соединениеОбновлений.Получить(запросКСерверуОбновлений, путьАрхиваШаблона);
        
        чтениеАрхива = Новый ЧтениеZipФайла(путьАрхиваШаблона);
        чтениеАрхива.ИзвлечьВсе(мКаталогШаблоновОбновленийПлатформы + "\" + мПоставка_Акроним + "\" + версияДляОбновления);
        чтениеАрхива.Закрыть();
        
        УдалитьФайлы(путьАрхиваШаблона);

    КонецЕсли;

    Если Не ФайлСуществует(путьКФайлуОбновления) Тогда
        ВызватьИсключение "Нет файла обновления " + путьКФайлуОбновления;

    КонецЕсли;

    //запускаем обновление
    параметрПодключенияБазы = "";
    Если ЗначениеЗаполнено(мБаза_Каталог) Тогда
        параметрПодключенияБазы = СтрШаблон("/F ""%1""", мБаза_Каталог);

    ИначеЕсли ЗначениеЗаполнено(мБаза_Сервер) И ЗначениеЗаполнено(мБаза_Имя) Тогда
        параметрПодключенияБазы = СтрШаблон("/S ""%1\%2""", мБаза_Сервер, мБаза_Имя);

    Иначе 
        параметрПодключенияБазы = "";

    КонецЕсли;

    командаОбновленияПлатформы = 
        СтрШаблон(
            """%1\1cv8.exe"" CONFIG %2 /N ""%3"" /P ""%4"" /OUT ""%5\batch.log"" -NoTruncate /DisableStartupMessages /DisableStartupDialogs /UpdateCfg %6 /UpdateDbCfg",
            мПлатформа_Путь, // %1
            параметрПодключенияБазы, // %2
            мБаза_ИмяПользователя, // %3 Пользователь базы
            мБаза_ПарольПользователя, // %4 Пароль пользователя
            мКаталогВременныхФайлов, // %5
            путьКФайлуОбновления // %6
        );
    ЗапуститьПриложениеБезошибочно(командаОбновленияПлатформы);

    УстановитьРелизИПлатформу();
    Если СтрЗаменить(мКонфигурация_Версия, ".", "_") <> версияДляОбновления Тогда
        ВызватьИсключение "Конфигурация не была обновлена на версию " + версияДляОбновления;

    КонецЕсли;

    ЗапуститьПриложениеБезошибочно("git switch type --force", мГИТ_Каталог);

    командаВыгрузкиВФайлы = 
        СтрШаблон(
            """%1\1cv8.exe"" CONFIG %2 /N ""%3"" /P ""%4"" /OUT ""%5\batch.log"" -NoTruncate /DisableStartupMessages /DisableStartupDialogs /DumpConfigToFiles ./conf",
            мПлатформа_Путь, // %1
            параметрПодключенияБазы, // %2
            мБаза_ИмяПользователя, // %3 Пользователь базы
            мБаза_ПарольПользователя, // %4 Пароль пользователя
            мКаталогВременныхФайлов // %5
        );
    ЗапуститьПриложениеБезошибочно(командаВыгрузкиВФайлы, мГИТ_Каталог);

    ЗапуститьПриложениеБезошибочно("git add .", мГИТ_Каталог);
    ЗапуститьПриложениеБезошибочно(СтрШаблон("git commit -m ""%1""", версияДляОбновления), мГИТ_Каталог);
     
    Сообщить(
        "Приехали!
        |========
        |"
        );

    Если мПриУспехеОбновлятьСледующим Тогда
        Сообщить(
            "На конце мочало, начинай сначала
            |========
            |"
            );
        Основная();

    КонецЕсли;

КонецПроцедуры // Основная

Процедура ЗапуститьПриложениеБезошибочно(пКомандаОС, пКаталог = Неопределено, пКодВозврата = 0)

    пКодВозврата = 0;

    Сообщить(пКомандаОС);

    ЗапуститьПриложение(пКомандаОС, пКаталог, Истина, пКодВозврата);

    Если пКодВозврата <> 0 Тогда
        ВызватьИсключение СтрШаблон("Ошибка выполнения команды '%1'", пКомандаОС);

    КонецЕсли;

КонецПроцедуры

Функция ФайлСуществует(Знач ПутьКФайлу) Экспорт
    
    Файл = Новый Файл(ПутьКФайлу);
    Возврат Файл.Существует();
    
КонецФункции

Процедура УстановитьРелизИПлатформу()
    
    мКонфигурация_Версия = Неопределено;

    строкаСоединенияИнформационнойБазы = "";

    Если ЗначениеЗаполнено(мБаза_Каталог) Тогда
        строкаСоединенияИнформационнойБазы = 
            СтрШаблон(
                "file=""%1"";Usr=""%2"";Pwd=""%3""",
                мБаза_Каталог, // %1 ИмяСервера
                мБаза_ИмяПользователя, // %2 Пользователь базы
                мБаза_ПарольПользователя // %3 Пароль
            );

    ИначеЕсли ЗначениеЗаполнено(мБаза_Сервер) И ЗначениеЗаполнено(мБаза_Имя) Тогда
        строкаСоединенияИнформационнойБазы = 
            СтрШаблон(
                "srvr=""%1"";ref=""%2"";Usr=""%3"";Pwd=""%4""",
                мБаза_Сервер, // %1 ИмяСервера
                мБаза_Имя, // %2 ИмяБазы
                мБаза_ИмяПользователя, // %3 Пользователь базы
                мБаза_ПарольПользователя // %4 Пароль
            );

    Иначе
        строкаСоединенияИнформационнойБазы = "";

    КонецЕсли;

    Если Не ЗначениеЗаполнено(строкаСоединенияИнформационнойБазы) Тогда
        ВызватьИсключение "Не заполнена строка соединения информационной базы";

    КонецЕсли;
    
    строкаКоннектора = "V" + мПлатформа_Версия + ".COMConnector";
    коннекторПлатформы = Новый COMОбъект(строкаКоннектора);
    
    иб = коннекторПлатформы.Connect(строкаСоединенияИнформационнойБазы);
    
    мКонфигурация_Версия = иб.Метаданные.Версия;
    Сообщить("Текущая версия информационной базы " + мКонфигурация_Версия);
    
    коннекторПлатформы = Неопределено;
    
КонецПроцедуры // УстановитьРелизИПлатформу

// Загрузка списка обновлений из файла XML
// Достаем из XML файла, наибольший номер возможного обновления
Функция ПолучитьВерсиюДляОбновления(ИмяФайлаЗагрузки, ТекущаяВерсияКонфигурации)
    
    СообщениеОбОшибке = "Ошибка при чтении файла списка обновлений.";
    
    Если НЕ ФайлСуществует(ИмяФайлаЗагрузки) Тогда
        Сообщить("Нету XML файла (списка обновлений)");
        Возврат Неопределено;
    КонецЕсли;
    
    ВерсияДляОбновления = Неопределено;
    чтение = Новый ЧтениеXML;
    чтение.ОткрытьФайл(ИмяФайлаЗагрузки);
    чтение.Прочитать(); // <?xml version="1.0" encoding="UTF-8" ?>
    
    // Дата формирования файла.
    чтение.Прочитать();
    чтение.Прочитать();
    ДатаФормирования = чтение.Значение;
    чтение.Прочитать();
    // Читаем начало элемента Update или конец элемента UpdateList.
    Пока чтение.Прочитать() Цикл
        
        Если чтение.Имя = "v8u:updateList" Тогда
            Прервать;
        Иначе
            
            Конфигурация = чтение.ПолучитьАтрибут("configuration");
            
            Пока чтение.Прочитать() Цикл
                
                Если чтение.Имя = "v8u:update" Тогда
                    Прервать;
                Иначе
                    
                    Если чтение.Имя = "v8u:vendor" Тогда
                        чтение.Прочитать();
                        Поставщик = чтение.Значение;
                    ИначеЕсли чтение.Имя = "v8u:version" Тогда
                        чтение.Прочитать();
                        версия = чтение.Значение;
                    ИначеЕсли чтение.Имя = "v8u:file" Тогда
                        чтение.Прочитать();
                        ПутьКФайлуОбновления = чтение.Значение;
                    ИначеЕсли чтение.Имя = "v8u:size" Тогда
                        чтение.Прочитать();
                        РазмерФайлаОбновления = чтение.Значение;
                    ИначеЕсли чтение.Имя = "v8u:target" Тогда
                        чтение.Прочитать();
                        Если чтение.Значение = ТекущаяВерсияКонфигурации Тогда //279 Новые в конце. на последнюю полученную и будем обновяться
                            ВерсияДляОбновления = версия;
                        КонецЕсли;
                    КонецЕсли;
                    
                    чтение.Прочитать();
                    
                КонецЕсли;
                
            КонецЦикла;
            
        КонецЕсли;
        
    КонецЦикла;
    
    чтение.Закрыть();
    
    Возврат ВерсияДляОбновления;
    
КонецФункции // ВыполнитьЗагрузкуСпискаОбновлений()

Основная();